In [4]:
import pandas as pd

#create dataframe
df = pd.DataFrame({'aa':[1,2,3],'bb':[4,5,6],'cc':[7,8,9]})
print(df)

   aa  bb  cc
0   1   4   7
1   2   5   8
2   3   6   9

####最左边的那列是索引0,1,2

In [5]:
print('select aa column\n')
col = df['aa']
print(col)
print('--------')
print('Another way to select aa column\n')
col1 = df.aa
print(col1)

select aa column

0    1
1    2
2    3
Name: aa, dtype: int64
--------
Another way to select aa column

0    1
1    2
2    3
Name: aa, dtype: int64

In [11]:
print('select the first line')
line = df[:1]
print(line)
print('------------------')

print(df[1:])
print('------------------')
print(df[0:1])
print('------------------')
print(df[1:2])
print('------------------')
print(df[:])
print('------------------')
print(df[:-1])
print('------------------')
print(df[-1:])
print('------------------')
print(df[:2])

select the first line
   aa  bb  cc
0   1   4   7
------------------
   aa  bb  cc
1   2   5   8
2   3   6   9
------------------
   aa  bb  cc
0   1   4   7
------------------
   aa  bb  cc
1   2   5   8
------------------
   aa  bb  cc
0   1   4   7
1   2   5   8
2   3   6   9
------------------
   aa  bb  cc
0   1   4   7
1   2   5   8
------------------
   aa  bb  cc
2   3   6   9
------------------
   aa  bb  cc
0   1   4   7
1   2   5   8

In [13]:
print('find the second object in col bb')
obj = df['bb'][1]
print('bb列的第二个为：',obj,'\n')

print('改变数值：')
df['bb'] = 100
obj = df['bb'][1
print('改变后数值为：',obj,'\n')

find the second object in col bb
bb列的第二个为： 5

改变数值：
改变后数值为： 100

In [21]:
df1 = pd.DataFrame({'key':['a','b','c'],'value':[1,2,3]})
print(df1)
df2 = pd.DataFrame({'key':['a','b','c'],'value':[4,5,6]})
print(df2)
print('-----------------------')
df3 = pd.concat([df1,df2])
print(df3)

  key  value
0   a      1
1   b      2
2   c      3
  key  value
0   a      4
1   b      5
2   c      6
-----------------------
  key  value
0   a      1
1   b      2
2   c      3
0   a      4
1   b      5
2   c      6

In [20]:
df1=pd.DataFrame({'key':['a','b','c'],'value1':[1,2,3]})
print(df1)
print('---------------------')
df2=pd.DataFrame({'key':['a','b','c'],'value2':[4,5,6]}) 
print(df2)
print('---------------------')
df3=pd.merge(df1,df2)
print(df3)

  key  value1
0   a       1
1   b       2
2   c       3
---------------------
  key  value2
0   a       4
1   b       5
2   c       6
---------------------
  key  value1  value2
0   a       1       4
1   b       2       5
2   c       3       6

In [22]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[5,6,7,8],'col4':[3,4,5,6]})
df

   col1  col2  col4
0     1     5     3
1     2     6     4
2     3     7     5
3     4     8     6

In [24]:
import os
path = os.path.dirname(os.path.abspath('__file__'))
print(path)

C:\Users\FuYuf

In [25]:
import os
path = os.getcwd()
print(path)

C:\Users\FuYuf

In [27]:
os.chdir("C:/Users/FuYuf/Desktop")
df.to_excel('dataframe.xlsx')

In [28]:
df2 = pd.read_excel('dataframe.xlsx')
df2

   Unnamed: 0  col1  col2  col4
0           0     1     5     3
1           1     2     6     4
2           2     3     7     5
3           3     4     8     6

In [29]:
print('add one column, value=1')
df2['col5'] = [1,2,3,4]
print(df2,'\n')
print('第一列第四个数改成0')
df2['col1'][3] = 0
df2

add one column, value=1
   Unnamed: 0  col1  col2  col4  col5
0           0     1     5     3     1
1           1     2     6     4     2
2           2     3     7     5     3
3           3     4     8     6     4

第一列第四个数改成0

   Unnamed: 0  col1  col2  col4  col5
0           0     1     5     3     1
1           1     2     6     4     2
2           2     3     7     5     3
3           3     0     8     6     4

In [30]:
df2.to_excel('dataframe.xlsx')

In [31]:
df2.to_csv('data2.csv')

In [32]:
df3 = pd.read_csv('data2.csv')
df3

   Unnamed: 0  Unnamed: 0.1  col1  col2  col4  col5
0           0             0     1     5     3     1
1           1             1     2     6     4     2
2           2             2     3     7     5     3
3           3             3     0     8     6     4

In [33]:
list(df3)

['Unnamed: 0', 'Unnamed: 0.1', 'col1', 'col2', 'col4', 'col5']

In [37]:
df3 = df3.drop('Unnamed: 0.1',1)  #first drop Unname：0 那一列
df3

   col1  col2  col4  col5
0     1     5     3     1
1     2     6     4     2
2     3     7     5     3
3     0     8     6     4